:PROPERTIES:
:ID:       0f75c689-ce6d-42fb-9d45-524f825fc40d
:END:
#+title: py-ds-list
#+date: [2024-08-04 周日]
#+last_modified:  

*Index*
- [[pop]]
- [[+]]
- [[visit]]
- [[append]]
- [[insert]] 
- [[del]]
- [[pop]]
- [[remove]]
- [[sort]]
- [[sorted]]
- [[len]]
- [[range]]
- [[for-range]]
- [[range-2step]]
- [[max-min-sum]]
- [[ls-exp]]
- [[slice]]


#+NAME: ls
#+BEGIN_SRC python :noweb yes
ls = ['i', 'cannot', 'see', 'tigger']

return ls
#+END_SRC

#+RESULTS:
| i | cannot | see | tigger |



#+NAME: +
#+BEGIN_SRC python :noweb yes
ls = ['i', 'cannot', 'see', 'tigger']

return ls[0]+ls[1]+ls[2]+ls[3]
#+END_SRC

#+RESULTS:
: icannotseetigger


#+NAME: visit
#+BEGIN_SRC python :noweb yes
ls = ['i', 'cannot', 'see', 'tigger']

ls[0] = 'you'

return ls
#+END_SRC

#+RESULTS:
| you | cannot | see | tigger |


#+NAME: append
#+BEGIN_SRC python :noweb yes
ls = ['i', 'cannot', 'see', 'tigger']
ls.append('and')
ls.append('cat')

return ls
#+END_SRC

#+RESULTS:
| i | cannot | see | tigger | and | cat |

#+NAME: insert
#+BEGIN_SRC python :noweb yes
ls = ['i', 'cannot', 'see', 'tigger']

ls.insert(3, 'cat')
ls.insert(4, 'and')

return ls
#+END_SRC

#+RESULTS:
| i | cannot | see | cat | and | tigger |


#+NAME: del
#+BEGIN_SRC python :noweb yes
ls = ['i', 'cannot', 'see', 'tigger', 'anc', 'cat']

del ls[3]
del ls[3]

return ls
return ls
#+END_SRC

#+RESULTS:
| i | cannot | see | cat |



#+NAME: pop
#+BEGIN_SRC python :noweb yes
ls = ['i', 'cannot', 'see', 'tigger', 'anc', 'cat']

return ls.pop() + ls.pop(0) + ls.pop(1)
#+END_SRC

#+RESULTS:
: catisee

#+NAME: remove
#+BEGIN_SRC python :noweb yes
ls = ['i', 'i', 'and', 'you', 'cannot', 'see', 'tigger', 'anc', 'cat']

ls.remove('i')

return ls
#+END_SRC

#+RESULTS: remove
| i | and | you | cannot | see | tigger | anc | cat |


#+NAME: sort
#+BEGIN_SRC python :noweb yes
ls = ['i', 'i', 'and', 'you', 'cannot', 'see', 'tigger', 'anc', 'cat']
ls1 = ['i', 'i', 'and', 'you', 'cannot', 'see', 'tigger', 'anc', 'cat']

ls.sort()
ls1.sort(reverse=True)
return ls + ls1
#+END_SRC

#+RESULTS:
| anc | and | cannot | cat | i | i | see | tigger | you | you | tigger | see | i | i | cat | cannot | and | anc |

#+NAME: sorted
#+BEGIN_SRC python :noweb yes
ls = ['i', 'i', 'and', 'you', 'cannot', 'see', 'tigger', 'anc', 'cat']

ls1 = sorted(ls)
ls2 = sorted(ls, reverse=True)

return ls + ls1 + ls2
#+END_SRC

#+RESULTS: sorted
| i | i | and | you | cannot | see | tigger | anc | cat | anc | and | cannot | cat | i | i | see | tigger | you | you | tigger | see | i | i | cat | cannot | and | anc |



#+NAME: reverse
#+BEGIN_SRC python :noweb yes
ls = ['i', 'i', 'and', 'you', 'cannot', 'see', 'tigger', 'anc', 'cat']

ls.reverse()
return ls
#+END_SRC

#+RESULTS:
| cat | anc | tigger | see | cannot | you | and | i | i |


#+NAME: len
#+BEGIN_SRC python :noweb yes
ls = ['i', 'i', 'and', 'you', 'cannot', 'see', 'tigger', 'anc', 'cat']

return len(ls)
#+END_SRC

#+RESULTS: reverse
: 9


#+BEGIN_SRC python :noweb yes :results output
ls = ['i', 'i', 'and', 'you', 'cannot', 'see', 'tigger', 'anc', 'cat']

for w in ls:
  print(w)

#+END_SRC

#+RESULTS:
: i
: i
: and
: you
: cannot
: see
: tigger
: anc
: cat


#+NAME:range
#+BEGIN_SRC python :noweb yes
return range(5)
#+END_SRC

#+RESULTS: range
: range(0, 5)

#+NAME: for-range
#+BEGIN_SRC python :noweb yes :results output
for i in range(5):
  for j in range(1, 5):
    print(i, j, end=',')
  print()
#+END_SRC

#+RESULTS: for-range
: 0 1,0 2,0 3,0 4,
: 1 1,1 2,1 3,1 4,
: 2 1,2 2,2 3,2 4,
: 3 1,3 2,3 3,3 4,
: 4 1,4 2,4 3,4 4,

#+NAME range2ls
#+BEGIN_SRC python :noweb yes
ls = list(range(5))

return ls
#+END_SRC

#+RESULTS:
| 0 | 1 | 2 | 3 | 4 |

#+NAME: range-2step
#+BEGIN_SRC python :noweb yes
ls = list(range(0, 10, 2))

return ls
#+END_SRC

#+RESULTS: range-2step
| 0 | 2 | 4 | 6 | 8 |


#+NAME: max-min-sum
#+BEGIN_SRC python :noweb yes
ls = list(range(0, 10))

return f'min: {min(ls)}\nmax:{max(ls)}\nsum:{sum(ls)}'
#+END_SRC

#+RESULTS:
: min: 0
: max:9
: sum:45

#+NAME: ls-exp
#+BEGIN_SRC python :noweb yes
ls_sq = [v**2 for v in range(1, 11)]

return ls_sq
#+END_SRC

#+RESULTS: ls-exp
| 1 | 4 | 9 | 16 | 25 | 36 | 49 | 64 | 81 | 100 |


#+NAME: slice
#+BEGIN_SRC python :noweb yes :results output
ls = list(range(1, 11))

print(ls)
print(ls[:])
print(ls[0:3])
print(ls[5:])
print(ls[:5])
print(ls[-5])
print(ls[1:-1])

#+END_SRC

#+RESULTS: slice
: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
: [1, 2, 3]
: [6, 7, 8, 9, 10]
: [1, 2, 3, 4, 5]
: 6
: [2, 3, 4, 5, 6, 7, 8, 9]

#+RESULTS:
: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
: [1, 2, 3]
: [6, 7, 8, 9, 10]
: [1, 2, 3, 4, 5]
: 6
: [2, 3, 4, 5, 6, 7, 8, 9]


